plachta-zabatt/ArduinoCore-samd/boards.txt
electroniccats_makech.name=Electronic Cats Escornabot Makech
electroniccats_makech.vid.0=0x1209
electroniccats_makech.pid.0=0xBAB6
electroniccats_makech.vid.1=0x1209
electroniccats_makech.pid.1=0xBAB6
electroniccats_makech.upload.tool=bossac
electroniccats_makech.upload.protocol=sam-ba
electroniccats_makech.upload.maximum_size=253952
electroniccats_makech.upload.offset=0x2000
electroniccats_makech.upload.use_1200bps_touch=true
electroniccats_makech.upload.wait_for_upload_port=true
electroniccats_makech.upload.native_usb=true
electroniccats_makech.build.mcu=cortex-m0plus
electroniccats_makech.build.mathlib=arm_cortexM0l_math
electroniccats_makech.build.f_cpu=48000000L
electroniccats_makech.build.usb_product="Escornabot Makech"
electroniccats_makech.build.usb_manufacturer="Electronic Cats"
electroniccats_makech.build.board=makech
electroniccats_makech.build.core=arduino
electroniccats_makech.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21G18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
electroniccats_makech.build.ldscript=flash_256KB.ld
electroniccats_makech.build.openocdscript=openocd_scripts/SAMD21G15A.cfg
electroniccats_makech.build.variant=makech
electroniccats_makech.build.variant_system_lib=
electroniccats_makech.build.vid=0x1209
electroniccats_makech.build.pid=0xBAB6
electroniccats_makech.bootloader.tool=openocd
electroniccats_makech.bootloader.file=makech/bootloader-escornabot_makech-v3.3.0.bin
electroniccats_makech.menu.float.default=Print & String use auto-promoted doubles only
electroniccats_makech.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
electroniccats_makech.menu.float.print=Print uses separate singles and doubles
electroniccats_makech.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
electroniccats_makech.menu.float.string=String uses separate singles and doubles
electroniccats_makech.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
electroniccats_makech.menu.float.both=Print & String use separate singles and doubles
electroniccats_makech.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
electroniccats_makech.menu.config.disabled=config.h disabled
electroniccats_makech.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
electroniccats_makech.menu.config.enabled=config.h enabled (mostly code size reductions)
electroniccats_makech.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
electroniccats_makech.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
electroniccats_makech.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
electroniccats_makech.menu.clock.internal=INTERNAL_OSCILLATOR
electroniccats_makech.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
electroniccats_makech.menu.clock.crystal_32k=32KHZ_CRYSTAL
electroniccats_makech.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
electroniccats_makech.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
electroniccats_makech.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
electroniccats_makech.menu.timer.timer_732Hz=732.4Hz (16-bit)
electroniccats_makech.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
electroniccats_makech.menu.timer.timer_366Hz=366.2Hz (16-bit)
electroniccats_makech.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
electroniccats_makech.menu.timer.timer_244Hz=244.1Hz (16-bit)
electroniccats_makech.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
electroniccats_makech.menu.timer.timer_183Hz=183.1Hz (16-bit)
electroniccats_makech.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
electroniccats_makech.menu.timer.timer_146Hz=146.5Hz (16-bit)
electroniccats_makech.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
electroniccats_makech.menu.timer.timer_122Hz=122.1Hz (16-bit)
electroniccats_makech.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
electroniccats_makech.menu.timer.timer_105Hz=104.6Hz (16-bit)
electroniccats_makech.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
electroniccats_makech.menu.timer.timer_81Hz=81.38Hz (16-bit)
electroniccats_makech.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
electroniccats_makech.menu.timer.timer_61Hz=61.04Hz (16-bit)
electroniccats_makech.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
electroniccats_makech.menu.timer.timer_31Hz=30.52Hz (16-bit)
electroniccats_makech.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
electroniccats_makech.menu.timer.timer_187500Hz=187500Hz (8-bit)
electroniccats_makech.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
electroniccats_makech.menu.timer.timer_93750Hz=93750Hz (8-bit)
electroniccats_makech.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
electroniccats_makech.menu.timer.timer_62500Hz=62500Hz (8-bit)
electroniccats_makech.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
electroniccats_makech.menu.timer.timer_37500Hz=37500Hz (8-bit)
electroniccats_makech.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
electroniccats_makech.menu.timer.timer_20833Hz=20833Hz (8-bit)
electroniccats_makech.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
electroniccats_makech.menu.timer.timer_12500Hz=12500Hz (8-bit)
electroniccats_makech.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
electroniccats_makech.menu.timer.timer_7500Hz=7500Hz (8-bit)
electroniccats_makech.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
electroniccats_makech.menu.timer.timer_4166Hz=4166Hz (8-bit)
electroniccats_makech.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
electroniccats_makech.menu.timer.timer_2930Hz=2930Hz (8-bit)
electroniccats_makech.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
electroniccats_makech.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
electroniccats_makech.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
electroniccats_makech.menu.bootloader.8kb=8KB_BOOTLOADER
electroniccats_makech.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
electroniccats_makech.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
electroniccats_makech.menu.bootloader.8kb.upload.tool=bossac
electroniccats_makech.menu.bootloader.8kb.upload.use_1200bps_touch=true
electroniccats_makech.menu.bootloader.8kb.upload.wait_for_upload_port=true
electroniccats_makech.menu.bootloader.8kb.upload.native_usb=true
electroniccats_makech.menu.usb.cdc=CDC_ONLY
electroniccats_makech.menu.usb.cdc.build.usbcom=CDC_ONLY
electroniccats_makech.menu.usb.cdc.build.pid=0xBAB6
electroniccats_makech.menu.usb.cdc_hid=CDC_HID
electroniccats_makech.menu.usb.cdc_hid.build.usbcom=CDC_HID
electroniccats_makech.menu.usb.cdc_hid.build.pid=0xBAB6
electroniccats_makech.menu.usb.withcdc=WITH_CDC
electroniccats_makech.menu.usb.withcdc.build.usbcom=WITH_CDC
electroniccats_makech.menu.usb.withcdc.build.pid=0xBAB6
electroniccats_makech.menu.usb.hid=HID_ONLY
electroniccats_makech.menu.usb.hid.build.usbcom=HID_ONLY
electroniccats_makech.menu.usb.hid.build.pid=0xBAB6
electroniccats_makech.menu.usb.nocdc=WITHOUT_CDC
electroniccats_makech.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
electroniccats_makech.menu.usb.nocdc.build.pid=0xBAB6
electroniccats_makech.menu.usb.none=USB_DISABLED
electroniccats_makech.menu.usb.none.build.usbcom=USB_DISABLED
electroniccats_makech.menu.usb.none.build.pid=0xBAB6

# CatWAN Tracker

electroniccats_catwan_tracker.name=Electronic Cats CatWAN Tracker
electroniccats_catwan_tracker.vid.0=0x1209
electroniccats_catwan_tracker.pid.0=0xBAB9
electroniccats_catwan_tracker.vid.1=0x1209
electroniccats_catwan_tracker.pid.1=0xBAB9
electroniccats_catwan_tracker.upload.tool=bossac
electroniccats_catwan_tracker.upload.protocol=sam-ba
electroniccats_catwan_tracker.upload.maximum_size=253952
electroniccats_catwan_tracker.upload.offset=0x2000
electroniccats_catwan_tracker.upload.use_1200bps_touch=true
electroniccats_catwan_tracker.upload.wait_for_upload_port=true
electroniccats_catwan_tracker.upload.native_usb=true
electroniccats_catwan_tracker.build.mcu=cortex-m0plus
electroniccats_catwan_tracker.build.mathlib=arm_cortexM0l_math
electroniccats_catwan_tracker.build.f_cpu=48000000L
electroniccats_catwan_tracker.build.usb_product="CatWAN Tracker"
electroniccats_catwan_tracker.build.usb_manufacturer="Electronic Cats"
electroniccats_catwan_tracker.build.board=catwan_tracker
electroniccats_catwan_tracker.build.core=arduino
electroniccats_catwan_tracker.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21E18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
electroniccats_catwan_tracker.build.ldscript=flash_256KB.ld
electroniccats_catwan_tracker.build.openocdscript=openocd_scripts/SAMD21E18A.cfg
electroniccats_catwan_tracker.build.variant=catwan_tracker
electroniccats_catwan_tracker.build.variant_system_lib=
electroniccats_catwan_tracker.build.vid=0x1209
electroniccats_catwan_tracker.build.pid=0xBAB9
electroniccats_catwan_tracker.bootloader.tool=openocd
electroniccats_catwan_tracker.bootloader.file=catwan_tracker/bootloader-tracker-v3.3.0.bin
electroniccats_catwan_tracker.menu.float.default=Print & String use auto-promoted doubles only
electroniccats_catwan_tracker.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
electroniccats_catwan_tracker.menu.float.print=Print uses separate singles and doubles
electroniccats_catwan_tracker.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
electroniccats_catwan_tracker.menu.float.string=String uses separate singles and doubles
electroniccats_catwan_tracker.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
electroniccats_catwan_tracker.menu.float.both=Print & String use separate singles and doubles
electroniccats_catwan_tracker.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
electroniccats_catwan_tracker.menu.config.disabled=config.h disabled
electroniccats_catwan_tracker.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
electroniccats_catwan_tracker.menu.config.enabled=config.h enabled (mostly code size reductions)
electroniccats_catwan_tracker.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
electroniccats_catwan_tracker.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
electroniccats_catwan_tracker.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
electroniccats_catwan_tracker.menu.clock.internal=INTERNAL_OSCILLATOR
electroniccats_catwan_tracker.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
electroniccats_catwan_tracker.menu.clock.crystal_32k=32KHZ_CRYSTAL
electroniccats_catwan_tracker.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
electroniccats_catwan_tracker.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
electroniccats_catwan_tracker.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
electroniccats_catwan_tracker.menu.timer.timer_732Hz=732.4Hz (16-bit)
electroniccats_catwan_tracker.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
electroniccats_catwan_tracker.menu.timer.timer_366Hz=366.2Hz (16-bit)
electroniccats_catwan_tracker.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
electroniccats_catwan_tracker.menu.timer.timer_244Hz=244.1Hz (16-bit)
electroniccats_catwan_tracker.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
electroniccats_catwan_tracker.menu.timer.timer_183Hz=183.1Hz (16-bit)
electroniccats_catwan_tracker.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
electroniccats_catwan_tracker.menu.timer.timer_146Hz=146.5Hz (16-bit)
electroniccats_catwan_tracker.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
electroniccats_catwan_tracker.menu.timer.timer_122Hz=122.1Hz (16-bit)
electroniccats_catwan_tracker.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
electroniccats_catwan_tracker.menu.timer.timer_105Hz=104.6Hz (16-bit)
electroniccats_catwan_tracker.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
electroniccats_catwan_tracker.menu.timer.timer_81Hz=81.38Hz (16-bit)
electroniccats_catwan_tracker.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
electroniccats_catwan_tracker.menu.timer.timer_61Hz=61.04Hz (16-bit)
electroniccats_catwan_tracker.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
electroniccats_catwan_tracker.menu.timer.timer_31Hz=30.52Hz (16-bit)
electroniccats_catwan_tracker.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
electroniccats_catwan_tracker.menu.timer.timer_187500Hz=187500Hz (8-bit)
electroniccats_catwan_tracker.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
electroniccats_catwan_tracker.menu.timer.timer_93750Hz=93750Hz (8-bit)
electroniccats_catwan_tracker.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
electroniccats_catwan_tracker.menu.timer.timer_62500Hz=62500Hz (8-bit)
electroniccats_catwan_tracker.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
electroniccats_catwan_tracker.menu.timer.timer_37500Hz=37500Hz (8-bit)
electroniccats_catwan_tracker.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
electroniccats_catwan_tracker.menu.timer.timer_20833Hz=20833Hz (8-bit)
electroniccats_catwan_tracker.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
electroniccats_catwan_tracker.menu.timer.timer_12500Hz=12500Hz (8-bit)
electroniccats_catwan_tracker.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
electroniccats_catwan_tracker.menu.timer.timer_7500Hz=7500Hz (8-bit)
electroniccats_catwan_tracker.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
electroniccats_catwan_tracker.menu.timer.timer_4166Hz=4166Hz (8-bit)
electroniccats_catwan_tracker.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
electroniccats_catwan_tracker.menu.timer.timer_2930Hz=2930Hz (8-bit)
electroniccats_catwan_tracker.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
electroniccats_catwan_tracker.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
electroniccats_catwan_tracker.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
electroniccats_catwan_tracker.menu.bootloader.8kb=8KB_BOOTLOADER
electroniccats_catwan_tracker.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
electroniccats_catwan_tracker.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
electroniccats_catwan_tracker.menu.bootloader.8kb.upload.tool=bossac
electroniccats_catwan_tracker.menu.bootloader.8kb.upload.use_1200bps_touch=true
electroniccats_catwan_tracker.menu.bootloader.8kb.upload.wait_for_upload_port=true
electroniccats_catwan_tracker.menu.bootloader.8kb.upload.native_usb=true
electroniccats_catwan_tracker.menu.usb.cdc=CDC_ONLY
electroniccats_catwan_tracker.menu.usb.cdc.build.usbcom=CDC_ONLY
electroniccats_catwan_tracker.menu.usb.cdc.build.pid=0xBAB9
electroniccats_catwan_tracker.menu.usb.cdc_hid=CDC_HID
electroniccats_catwan_tracker.menu.usb.cdc_hid.build.usbcom=CDC_HID
electroniccats_catwan_tracker.menu.usb.cdc_hid.build.pid=0xBAB9
electroniccats_catwan_tracker.menu.usb.withcdc=WITH_CDC
electroniccats_catwan_tracker.menu.usb.withcdc.build.usbcom=WITH_CDC
electroniccats_catwan_tracker.menu.usb.withcdc.build.pid=0xBAB9
electroniccats_catwan_tracker.menu.usb.hid=HID_ONLY
electroniccats_catwan_tracker.menu.usb.hid.build.usbcom=HID_ONLY
electroniccats_catwan_tracker.menu.usb.hid.build.pid=0xBAB9
electroniccats_catwan_tracker.menu.usb.nocdc=WITHOUT_CDC
electroniccats_catwan_tracker.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
electroniccats_catwan_tracker.menu.usb.nocdc.build.pid=0xBAB9
electroniccats_catwan_tracker.menu.usb.none=USB_DISABLED
electroniccats_catwan_tracker.menu.usb.none.build.usbcom=USB_DISABLED
electroniccats_catwan_tracker.menu.usb.none.build.pid=0xBAB9

# NFC Copy Cat

